<template>
  <v-container fluid d-flex>
    <LeftWidget />
    <div class="col-4">
      Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. Повседневная практика показывает, что реализация намеченных плановых заданий в значительной степени обуславливает создание модели развития.
      Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. Идейные соображения высшего порядка, а также дальнейшее развитие различных форм деятельности позволяет оценить значение новых предложений.
      С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. С другой стороны рамки и место обучения кадров способствует подготовки и реализации модели развития.
    </div>
    <img class="col-4" :src="image.image" alt="">
  </v-container>
</template>

<script>
import LeftWidget from "../components/LeftWidget";
export default {
  name: "MainPage",
  components: {
    LeftWidget,
  },
  data: () => ({
    image: ''
  }),
  async mounted() {
    const res = await fetch('https://demo-api.vsdev.space/api/brom/home_page')
    const image = await res.json()
    this.image = image
  }
};
</script>

<style scoped>
</style>